remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/samb11g18a.h
#define PINMUX_LP_GPIO_4_M_QUAD_DEC1_B            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_QUAD_DEC1_B<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_PWM3_OUT               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_PWM3_OUT<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_QUAD_DEC0_A            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_QUAD_DEC0_A<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_PWM0_OUT               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_PWM0_OUT<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_QUAD_DEC1_A            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_QUAD_DEC1_A<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_PWM2_OUT               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_PWM2_OUT<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_UART0_CTS                ( PIN_LP_GPIO_4<<16 | MUX_LP_GPIO_4_UART0_CTS )
#define PINMUX_LP_GPIO_4_SPI0_SSN                 ( PIN_LP_GPIO_4<<16 | MUX_LP_GPIO_4_SPI0_SSN )
#define PINMUX_LP_GPIO_4_SPI_FLASH0_SSN           ( PIN_LP_GPIO_4<<16 | MUX_LP_GPIO_4_SPI_FLASH0_SSN )
#define PINMUX_LP_GPIO_4_TEST_OUT_4               ( PIN_LP_GPIO_4<<16 | MUX_LP_GPIO_4_TEST_OUT_4 )
#define PINMUX_LP_GPIO_4_GPIO                     ( PIN_LP_GPIO_4<<16 | MUX_LP_GPIO_4_GPIO )
#define PINMUX_LP_GPIO_4_SPI1_SSN                 ( PIN_LP_GPIO_4<<16 | MUX_LP_GPIO_4_SPI1_SSN )
/* PinMux macros for LP_GPIO_5 */
#define PINMUX_LP_GPIO_5_SPI_FLASH0_RXD           ( PIN_LP_GPIO_5<<16 | MUX_LP_GPIO_5_SPI_FLASH0_RXD )
#define PINMUX_LP_GPIO_5_M_I2C0_SCL               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_I2C0_SCL<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART1_CTS              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART1_CTS<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_TX            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_TX<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART0_RTS              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART0_RTS<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART0_RXD              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART0_RXD<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_32KHZ_CLK              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_32KHZ_CLK<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART0_TXD              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART0_TXD<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART1_TXD              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART1_TXD<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_I2C1_SCL               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_I2C1_SCL<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_WLAN_RX           ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_WLAN_RX<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_WLAN_TX           ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_WLAN_TX<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_PWM1_OUT               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_PWM1_OUT<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_QUAD_DEC0_B            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_QUAD_DEC0_B<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART1_RTS              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART1_RTS<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART0_CTS              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART0_CTS<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_UART1_RXD              ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_UART1_RXD<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_I2C1_SDA               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_I2C1_SDA<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_I2C0_SDA               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_I2C0_SDA<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_QUAD_DEC2_A            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_QUAD_DEC2_A<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_QUAD_DEC2_B            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_QUAD_DEC2_B<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_RX            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_RX<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_QUAD_DEC1_B            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_QUAD_DEC1_B<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_PWM3_OUT               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_PWM3_OUT<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_QUAD_DEC0_A            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_QUAD_DEC0_A<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_PWM0_OUT               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_PWM0_OUT<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_QUAD_DEC1_A            ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_QUAD_DEC1_A<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_M_PWM2_OUT               ( PIN_LP_GPIO_5<<16 | MEGAMUX_LP_GPIO_5_PWM2_OUT<<8 | MUX_LP_GPIO_5_MEGAMUX )
#define PINMUX_LP_GPIO_5_SPI0_MISO                ( PIN_LP_GPIO_5<<16 | MUX_LP_GPIO_5_SPI0_MISO )
#define PINMUX_LP_GPIO_5_SPI1_MISO                ( PIN_LP_GPIO_5<<16 | MUX_LP_GPIO_5_SPI1_MISO )
#define PINMUX_LP_GPIO_5_TEST_OUT_5               ( PIN_LP_GPIO_5<<16 | MUX_LP_GPIO_5_TEST_OUT_5 )
#define PINMUX_LP_GPIO_5_UART0_RTS                ( PIN_LP_GPIO_5<<16 | MUX_LP_GPIO_5_UART0_RTS )
#define PINMUX_LP_GPIO_5_GPIO                     ( PIN_LP_GPIO_5<<16 | MUX_LP_GPIO_5_GPIO )
/* PinMux macros for LP_GPIO_6 */
#define PINMUX_LP_GPIO_6_M_I2C0_SCL               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_I2C0_SCL<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART1_CTS              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART1_CTS<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_TX            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_TX<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART0_RTS              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART0_RTS<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART0_RXD              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART0_RXD<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_32KHZ_CLK              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_32KHZ_CLK<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART0_TXD              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART0_TXD<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART1_TXD              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART1_TXD<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_I2C1_SCL               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_I2C1_SCL<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_WLAN_RX           ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_WLAN_RX<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_WLAN_TX           ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_WLAN_TX<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_PWM1_OUT               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_PWM1_OUT<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_QUAD_DEC0_B            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_QUAD_DEC0_B<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART1_RTS              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART1_RTS<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART0_CTS              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART0_CTS<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_UART1_RXD              ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_UART1_RXD<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_I2C1_SDA               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_I2C1_SDA<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_I2C0_SDA               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_I2C0_SDA<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_QUAD_DEC2_A            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_QUAD_DEC2_A<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_QUAD_DEC2_B            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_QUAD_DEC2_B<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_RX            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_RX<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_QUAD_DEC1_B            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_QUAD_DEC1_B<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_PWM3_OUT               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_PWM3_OUT<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_QUAD_DEC0_A            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_QUAD_DEC0_A<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_PWM0_OUT               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_PWM0_OUT<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_QUAD_DEC1_A            ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_QUAD_DEC1_A<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_M_PWM2_OUT               ( PIN_LP_GPIO_6<<16 | MEGAMUX_LP_GPIO_6_PWM2_OUT<<8 | MUX_LP_GPIO_6_MEGAMUX )
#define PINMUX_LP_GPIO_6_SPI_FLASH0_SCK           ( PIN_LP_GPIO_6<<16 | MUX_LP_GPIO_6_SPI_FLASH0_SCK )
#define PINMUX_LP_GPIO_6_UART1_RXD                ( PIN_LP_GPIO_6<<16 | MUX_LP_GPIO_6_UART1_RXD )
#define PINMUX_LP_GPIO_6_TEST_OUT_6               ( PIN_LP_GPIO_6<<16 | MUX_LP_GPIO_6_TEST_OUT_6 )
#define PINMUX_LP_GPIO_6_GPIO                     ( PIN_LP_GPIO_6<<16 | MUX_LP_GPIO_6_GPIO )
#define PINMUX_LP_GPIO_6_SPI0_SCK                 ( PIN_LP_GPIO_6<<16 | MUX_LP_GPIO_6_SPI0_SCK )
/* PinMux macros for LP_GPIO_7 */
#define PINMUX_LP_GPIO_7_SPI0_MOSI                ( PIN_LP_GPIO_7<<16 | MUX_LP_GPIO_7_SPI0_MOSI )
#define PINMUX_LP_GPIO_7_UART1_TXD                ( PIN_LP_GPIO_7<<16 | MUX_LP_GPIO_7_UART1_TXD )
#define PINMUX_LP_GPIO_7_M_I2C0_SCL               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_I2C0_SCL<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART1_CTS              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART1_CTS<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_TX            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_TX<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART0_RTS              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART0_RTS<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART0_RXD              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART0_RXD<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_32KHZ_CLK              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_32KHZ_CLK<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART0_TXD              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART0_TXD<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART1_TXD              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART1_TXD<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_I2C1_SCL               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_I2C1_SCL<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_WLAN_RX           ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_WLAN_RX<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_WLAN_TX           ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_WLAN_TX<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_PWM1_OUT               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_PWM1_OUT<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_QUAD_DEC0_B            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_QUAD_DEC0_B<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART1_RTS              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART1_RTS<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART0_CTS              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART0_CTS<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_UART1_RXD              ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_UART1_RXD<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_I2C1_SDA               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_I2C1_SDA<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_I2C0_SDA               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_I2C0_SDA<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_QUAD_DEC2_A            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_QUAD_DEC2_A<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_QUAD_DEC2_B            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_QUAD_DEC2_B<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_RX            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_RX<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_QUAD_DEC1_B            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_QUAD_DEC1_B<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_PWM3_OUT               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_PWM3_OUT<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_QUAD_DEC0_A            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_QUAD_DEC0_A<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_PWM0_OUT               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_PWM0_OUT<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_QUAD_DEC1_A            ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_QUAD_DEC1_A<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_M_PWM2_OUT               ( PIN_LP_GPIO_7<<16 | MEGAMUX_LP_GPIO_7_PWM2_OUT<<8 | MUX_LP_GPIO_7_MEGAMUX )
#define PINMUX_LP_GPIO_7_TEST_OUT_7               ( PIN_LP_GPIO_7<<16 | MUX_LP_GPIO_7_TEST_OUT_7 )
#define PINMUX_LP_GPIO_7_SPI_FLASH0_TXD           ( PIN_LP_GPIO_7<<16 | MUX_LP_GPIO_7_SPI_FLASH0_TXD )
#define PINMUX_LP_GPIO_7_GPIO                     ( PIN_LP_GPIO_7<<16 | MUX_LP_GPIO_7_GPIO )
/* PinMux macros for LP_GPIO_8 */
#define PINMUX_LP_GPIO_8_M_I2C0_SCL               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_I2C0_SCL<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART1_CTS              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART1_CTS<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_TX            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_TX<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART0_RTS              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART0_RTS<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART0_RXD              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART0_RXD<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_32KHZ_CLK              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_32KHZ_CLK<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART0_TXD              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART0_TXD<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART1_TXD              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART1_TXD<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_I2C1_SCL               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_I2C1_SCL<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_WLAN_RX           ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_WLAN_RX<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_WLAN_TX           ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_WLAN_TX<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_PWM1_OUT               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_PWM1_OUT<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_QUAD_DEC0_B            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_QUAD_DEC0_B<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART1_RTS              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART1_RTS<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART0_CTS              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART0_CTS<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_UART1_RXD              ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_UART1_RXD<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_I2C1_SDA               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_I2C1_SDA<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_I2C0_SDA               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_I2C0_SDA<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_QUAD_DEC2_A            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_QUAD_DEC2_A<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_QUAD_DEC2_B            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_QUAD_DEC2_B<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_RX            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_RX<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_QUAD_DEC1_B            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_QUAD_DEC1_B<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_PWM3_OUT               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_PWM3_OUT<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_QUAD_DEC0_A            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_QUAD_DEC0_A<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_PWM0_OUT               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_PWM0_OUT<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_QUAD_DEC1_A            ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_QUAD_DEC1_A<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_M_PWM2_OUT               ( PIN_LP_GPIO_8<<16 | MEGAMUX_LP_GPIO_8_PWM2_OUT<<8 | MUX_LP_GPIO_8_MEGAMUX )
#define PINMUX_LP_GPIO_8_SPI0_SSN                 ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_SPI0_SSN )
#define PINMUX_LP_GPIO_8_SPI_FLASH0_SSN           ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_SPI_FLASH0_SSN )
#define PINMUX_LP_GPIO_8_GPIO                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_GPIO )
#define PINMUX_LP_GPIO_8_I2C0_SDA                 ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_I2C0_SDA )
#define PINMUX_LP_GPIO_8_TEST_OUT_8               ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_TEST_OUT_8 )
/* PinMux macros for LP_GPIO_9 */
#define PINMUX_LP_GPIO_9_SPI_FLASH0_RXD           ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_SPI_FLASH0_RXD )
#define PINMUX_LP_GPIO_9_M_I2C0_SCL               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_I2C0_SCL<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART1_CTS              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART1_CTS<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_TX            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_TX<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART0_RTS              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART0_RTS<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART0_RXD              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART0_RXD<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_32KHZ_CLK              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_32KHZ_CLK<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART0_TXD              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART0_TXD<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART1_TXD              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART1_TXD<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_I2C1_SCL               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_I2C1_SCL<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_WLAN_RX           ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_WLAN_RX<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_WLAN_TX           ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_WLAN_TX<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_PWM1_OUT               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_PWM1_OUT<<8 | MUX_LP_GPIO_9_MEGAMUX )
