remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/samb11g18a.h
#define PINMUX_LP_GPIO_9_M_QUAD_DEC0_B            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_QUAD_DEC0_B<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART1_RTS              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART1_RTS<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART0_CTS              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART0_CTS<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_UART1_RXD              ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_UART1_RXD<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_I2C1_SDA               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_I2C1_SDA<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_I2C0_SDA               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_I2C0_SDA<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_QUAD_DEC2_A            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_QUAD_DEC2_A<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_QUAD_DEC2_B            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_QUAD_DEC2_B<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_RX            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_RX<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_QUAD_DEC1_B            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_QUAD_DEC1_B<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_PWM3_OUT               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_PWM3_OUT<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_QUAD_DEC0_A            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_QUAD_DEC0_A<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_PWM0_OUT               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_PWM0_OUT<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_QUAD_DEC1_A            ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_QUAD_DEC1_A<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_M_PWM2_OUT               ( PIN_LP_GPIO_9<<16 | MEGAMUX_LP_GPIO_9_PWM2_OUT<<8 | MUX_LP_GPIO_9_MEGAMUX )
#define PINMUX_LP_GPIO_9_SPI0_MISO                ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_SPI0_MISO )
#define PINMUX_LP_GPIO_9_I2C0_SCL                 ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_I2C0_SCL )
#define PINMUX_LP_GPIO_9_GPIO                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_GPIO )
#define PINMUX_LP_GPIO_9_TEST_OUT_9               ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_TEST_OUT_9 )
/* PinMux macros for LP_GPIO_10 */
#define PINMUX_LP_GPIO_10_GPIO                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_GPIO )
#define PINMUX_LP_GPIO_10_M_I2C0_SCL              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_I2C0_SCL<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART1_CTS             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART1_CTS<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_TX           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_TX<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART0_RTS             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART0_RTS<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART0_RXD             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART0_RXD<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_32KHZ_CLK             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_32KHZ_CLK<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART0_TXD             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART0_TXD<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART1_TXD             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART1_TXD<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_I2C1_SCL              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_I2C1_SCL<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_WLAN_RX          ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_WLAN_RX<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_WLAN_TX          ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_WLAN_TX<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_PWM1_OUT              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_PWM1_OUT<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_QUAD_DEC0_B           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_QUAD_DEC0_B<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART1_RTS             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART1_RTS<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART0_CTS             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART0_CTS<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_UART1_RXD             ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_UART1_RXD<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_I2C1_SDA              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_I2C1_SDA<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_I2C0_SDA              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_I2C0_SDA<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_QUAD_DEC2_A           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_QUAD_DEC2_A<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_QUAD_DEC2_B           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_QUAD_DEC2_B<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_RX           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_RX<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_QUAD_DEC1_B           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_QUAD_DEC1_B<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_PWM3_OUT              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_PWM3_OUT<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_QUAD_DEC0_A           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_QUAD_DEC0_A<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_PWM0_OUT              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_PWM0_OUT<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_QUAD_DEC1_A           ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_QUAD_DEC1_A<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_M_PWM2_OUT              ( PIN_LP_GPIO_10<<16 | MEGAMUX_LP_GPIO_10_PWM2_OUT<<8 | MUX_LP_GPIO_10_MEGAMUX )
#define PINMUX_LP_GPIO_10_TEST_OUT_10             ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_TEST_OUT_10 )
#define PINMUX_LP_GPIO_10_SPI_FLASH0_SCK          ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_SPI_FLASH0_SCK )
#define PINMUX_LP_GPIO_10_SPI0_SCK                ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_SPI0_SCK )
/* PinMux macros for LP_GPIO_11 */
#define PINMUX_LP_GPIO_11_SPI0_MOSI               ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_SPI0_MOSI )
#define PINMUX_LP_GPIO_11_GPIO                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_GPIO )
#define PINMUX_LP_GPIO_11_M_I2C0_SCL              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_I2C0_SCL<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART1_CTS             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART1_CTS<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_TX           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_TX<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART0_RTS             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART0_RTS<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART0_RXD             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART0_RXD<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_32KHZ_CLK             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_32KHZ_CLK<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART0_TXD             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART0_TXD<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART1_TXD             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART1_TXD<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_I2C1_SCL              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_I2C1_SCL<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_WLAN_RX          ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_WLAN_RX<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_WLAN_TX          ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_WLAN_TX<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_PWM1_OUT              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_PWM1_OUT<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_QUAD_DEC0_B           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_QUAD_DEC0_B<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART1_RTS             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART1_RTS<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART0_CTS             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART0_CTS<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_UART1_RXD             ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_UART1_RXD<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_I2C1_SDA              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_I2C1_SDA<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_I2C0_SDA              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_I2C0_SDA<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_QUAD_DEC2_A           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_QUAD_DEC2_A<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_QUAD_DEC2_B           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_QUAD_DEC2_B<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_RX           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_RX<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_QUAD_DEC1_B           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_QUAD_DEC1_B<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_PWM3_OUT              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_PWM3_OUT<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_QUAD_DEC0_A           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_QUAD_DEC0_A<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_PWM0_OUT              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_PWM0_OUT<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_QUAD_DEC1_A           ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_QUAD_DEC1_A<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_M_PWM2_OUT              ( PIN_LP_GPIO_11<<16 | MEGAMUX_LP_GPIO_11_PWM2_OUT<<8 | MUX_LP_GPIO_11_MEGAMUX )
#define PINMUX_LP_GPIO_11_SPI_FLASH0_TXD          ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_SPI_FLASH0_TXD )
#define PINMUX_LP_GPIO_11_TEST_OUT_11             ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_TEST_OUT_11 )
/* PinMux macros for LP_GPIO_12 */
#define PINMUX_LP_GPIO_12_SPI_FLASH0_SSN          ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_SPI_FLASH0_SSN )
#define PINMUX_LP_GPIO_12_GPIO                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_GPIO )
#define PINMUX_LP_GPIO_12_SPI0_SSN                ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_SPI0_SSN )
#define PINMUX_LP_GPIO_12_M_I2C0_SCL              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_I2C0_SCL<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART1_CTS             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART1_CTS<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_TX           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_TX<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART0_RTS             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART0_RTS<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART0_RXD             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART0_RXD<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_32KHZ_CLK             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_32KHZ_CLK<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART0_TXD             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART0_TXD<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART1_TXD             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART1_TXD<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_I2C1_SCL              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_I2C1_SCL<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_WLAN_RX          ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_WLAN_RX<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_WLAN_TX          ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_WLAN_TX<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_PWM1_OUT              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_PWM1_OUT<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_QUAD_DEC0_B           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_QUAD_DEC0_B<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART1_RTS             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART1_RTS<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART0_CTS             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART0_CTS<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_UART1_RXD             ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_UART1_RXD<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_I2C1_SDA              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_I2C1_SDA<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_I2C0_SDA              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_I2C0_SDA<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_QUAD_DEC2_A           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_QUAD_DEC2_A<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_QUAD_DEC2_B           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_QUAD_DEC2_B<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_RX           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_RX<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_QUAD_DEC1_B           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_QUAD_DEC1_B<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_PWM3_OUT              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_PWM3_OUT<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_QUAD_DEC0_A           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_QUAD_DEC0_A<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_PWM0_OUT              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_PWM0_OUT<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_QUAD_DEC1_A           ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_QUAD_DEC1_A<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_M_PWM2_OUT              ( PIN_LP_GPIO_12<<16 | MEGAMUX_LP_GPIO_12_PWM2_OUT<<8 | MUX_LP_GPIO_12_MEGAMUX )
#define PINMUX_LP_GPIO_12_TEST_OUT_12             ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_TEST_OUT_12 )
/* PinMux macros for LP_GPIO_13 */
#define PINMUX_LP_GPIO_13_GPIO                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_GPIO )
#define PINMUX_LP_GPIO_13_SPI_FLASH0_RXD          ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_SPI_FLASH0_RXD )
#define PINMUX_LP_GPIO_13_M_I2C0_SCL              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_I2C0_SCL<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART1_CTS             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART1_CTS<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_TX           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_TX<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART0_RTS             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART0_RTS<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART0_RXD             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART0_RXD<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_32KHZ_CLK             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_32KHZ_CLK<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART0_TXD             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART0_TXD<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART1_TXD             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART1_TXD<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_I2C1_SCL              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_I2C1_SCL<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_WLAN_RX          ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_WLAN_RX<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_WLAN_TX          ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_WLAN_TX<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_PWM1_OUT              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_PWM1_OUT<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC0_B           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC0_B<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART1_RTS             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART1_RTS<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART0_CTS             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART0_CTS<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_UART1_RXD             ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_UART1_RXD<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_I2C1_SDA              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_I2C1_SDA<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_I2C0_SDA              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_I2C0_SDA<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC2_A           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC2_A<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC2_B           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC2_B<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_RX           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_RX<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC1_B           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC1_B<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_PWM3_OUT              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_PWM3_OUT<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC0_A           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC0_A<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_PWM0_OUT              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_PWM0_OUT<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_QUAD_DEC1_A           ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_QUAD_DEC1_A<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_M_PWM2_OUT              ( PIN_LP_GPIO_13<<16 | MEGAMUX_LP_GPIO_13_PWM2_OUT<<8 | MUX_LP_GPIO_13_MEGAMUX )
#define PINMUX_LP_GPIO_13_SPI0_MISO               ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_SPI0_MISO )
#define PINMUX_LP_GPIO_13_TEST_OUT_13             ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_TEST_OUT_13 )
/* PinMux macros for LP_GPIO_14 */
#define PINMUX_LP_GPIO_14_TEST_OUT_14             ( PIN_LP_GPIO_14<<16 | MUX_LP_GPIO_14_TEST_OUT_14 )
#define PINMUX_LP_GPIO_14_GPIO                    ( PIN_LP_GPIO_14<<16 | MUX_LP_GPIO_14_GPIO )
#define PINMUX_LP_GPIO_14_I2C1_SDA                ( PIN_LP_GPIO_14<<16 | MUX_LP_GPIO_14_I2C1_SDA )
